app/controllers/audition_controller.rb

INSERT INTO `auditions` (`location`, `created_at`, `title`, `reqs`, `notes`, `updated_at`, `date`, `status`) VALUES('jklfdas', '2010-02-06 17:37:41', 'jfkdlsa', '', '', '2010-02-06 17:37:41', '2010-02-06 17:25:00', 0)
---
  def new
    if request.post?
      @audition = Audition.new(params[:audition])
      if @audition.save

SELECT * FROM `auditions` WHERE (`auditions`.`id` = 1)
---
  def view_audition
    @audition = Audition.find(params[:id])

SELECT * FROM `auditions` WHERE (`auditions`.`id` = 1)
---
  def flip_status
    if request.xhr?
      audition = Audition.find(params[:id])